SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/4DBYURNU8Q/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESD!ICESMSLB\/RES.LB!-3089594002348142718!1269867!0</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-12-06T18:05" ArrivalDateTime="2018-12-07T07:25" FlightNumber="692" NumberInParty="1" ResBookDesigCode="Q" Status="NN">      <DestinationLocation   LocationCode="AMS"/>      <Equipment AirEquipType="744"/>      <MarketingAirline Code="KL" FlightNumber="692"/>      <OperatingAirline Code="KL"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-07T12:35" ArrivalDateTime="2018-12-08T01:05" FlightNumber="871" NumberInParty="1" ResBookDesigCode="Q" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="KL" FlightNumber="871"/>      <OperatingAirline Code="KL"/>      <OriginLocation   LocationCode="AMS"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-20T03:20" ArrivalDateTime="2018-12-20T07:50" FlightNumber="872" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="AMS"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="KL" FlightNumber="872"/>      <OperatingAirline Code="KL"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-20T17:40" ArrivalDateTime="2018-12-20T19:50" FlightNumber="695" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="772"/>      <MarketingAirline Code="KL" FlightNumber="695"/>      <OperatingAirline Code="KL"/>      <OriginLocation   LocationCode="AMS"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>